{
  "@metadata": {
    "authors": [
      "Przemysław Owsianik"
    ],
    "last-updated": "2023-12-17",
    "locale": "en"
  },
  "nav-about": "About",
  "nav-skills": "Skills",
  "nav-stats": "Stats",
  "nav-contact": "Contact",
  "nav-portfolio": "Portfolio",
  "nav-language": "Language",
  "nav-polish": "Polish",
  "nav-english": "English",
  "about-header": "My name is Przemysław Owsianik",
  "about-p1": "I am a programmer and in the context of this website it is the most important information for you.",
  "about-p2": "My profession is my passion, so I devote my time to something - my most important resource - feeling that I am using it well.",
  "about-p3": "A synonym for programmer development is working on many different projects, so that 10 years of experience would not be one year repeated ten times.\n            My company - I work as a System Designer at KRUK S.A. on a daily basis. - it has provided me with this diversity, allowing me to expand my knowledge in many different branches,\n            from a typical backend, through web apps, to encouraging development towards artificial intelligence and machine learning.",
  "about-p4": "My next step is to start my own business, the website of which you are currently browsing, and offer my skills where they are needed.",
  "skills-technical": "TECHNICAL SKILLS",
  "skills-description": "A subjective representation of my technical value, relative to C # - the language in which I have the most experience",
  "skills-c#": "Used in most of my commercial projects",
  "skills-dotnet": "I use a large part of this platform on a daily basis",
  "skills-angular": "It is my main framework for web apps now",
  "skills-python": "I use it mainly for machine learning projects",
  "skills-ml": "One of my biggest interests, especially in the context of small projects",
  "skills-js": "I use it in about 30% of my projects",
  "skills-webdev": "So far, I have done more projects as a hobby than commercially",
  "stats-commercial" : "Years of commercial experience",
  "stats-noncommercial" : "Years of non-commercial experience",
  "stats-proj" : "Completed Projects",
  "stats-tech" : "Technologies and frameworks used",
  "contact-doyoulike" : "Do you like what you see?",
  "contact-header" : "If you think my skills can help you",
  "contact-button" : "Contact me",
  "prj-header" : "Examples of problems that I was solving",
  "prj-all": "All",
  "prj-app": "App",
  "prj-ml": "Machine Learning",
  "prj-web": "Web",
  "prj-title1": "Working with legacy code",
  "prj-text1": "Large monolithic refactorings",
  "prj-title2": "Maintenance of a large and legacy system",
  "prj-text2": "The system was the core of the state machine controlling the flow of main data in the company",
  "prj-title3": "Preparing solutions for a large call-center team",
  "prj-text3": " ",
  "prj-title4": "System that controls the content of user-entered information (GDPR)",
  "prj-text4": " ",
  "prj-title5": "E-commerce system",
  "prj-text5": " ",
  "prj-title6": "Mortgage data management system",
  "prj-text6": " ",
  "prj-title7": "Redesign and write the financial system as microservices",
  "prj-text7": " ",
  "prj-title8": "Cluster analysis",
  "prj-text8": "Finding a cluster analysis for demographic and financial data",
  "prj-title9": "Automatic photo tagging",
  "prj-text9": " ",
  "prj-title10": "Content management system for a blog",
  "prj-text10": " ",
  "prj-title11": "Preparing new functionalities for a large system related to handling complaint processes",
  "prj-text11": " ",
  "prj-title12": "Classification of customer data",
  "prj-text12": " ",
  "prj-title13": "Big web app for managing and conduct visits at customer",
  "prj-text13": " ",
  "prj-title14": "Gallery of pictures from travels",
}